dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_OFF (0u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_OFF (1u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_OFF (4u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_OFF (5u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_OFF (7u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_OFF (8u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_OFF (16u)

